astb_relise/src/Documents/УстановкаОсновногоМестаРаботыСотрудника/УстановкаОсновногоМестаРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаОсновногоМестаРаботыСотрудника</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>InformationRegister.ОсновноеМестоРаботыСотрудника</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновноеМестоРаботы</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаАСТБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеМестоРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/InformationRegisters/ОсновноеМестоРаботыСотрудника/ОсновноеМестоРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновноеМестоРаботыСотрудника</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсновноеМестоРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </resources>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/AccumulationRegisters/ЗанятыеРабочиеМеста/ЗанятыеРабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятыеРабочиеМеста</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/Documents/УстановкаОсновногоМестаРаботыСотрудника/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.Ссылка.Дата КАК Период,
	|	УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.Ссылка.Организация,
	|	УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.Ссылка.Сотрудник,
	|	УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.Подразделение,
	|	УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.Должность,
	|	УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.РабочееМесто,
	|	УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.ОсновноеМестоРаботы
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	Документ.УстановкаОсновногоМестаРаботыСотрудника.ОсновноеМестоРаботы КАК УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы
	|ГДЕ
	|	УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.Ссылка = &Ссылка
	|	И УстановкаОсновногоМестаРаботыСотрудникаОсновноеМестоРаботы.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.РабочееМесто
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			&ПериодРасчета,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.Период,
	|	ВТ_ТаблицаДокумента.Организация,
	|	ВТ_ТаблицаДокумента.Сотрудник,
	|	ВТ_ТаблицаДокумента.Подразделение,
	|	ВТ_ТаблицаДокумента.Должность,
	|	ВТ_ТаблицаДокумента.РабочееМесто,
	|	ВТ_ТаблицаДокумента.ОсновноеМестоРаботы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_ТаблицаДокумента.Подразделение = ВТ_ОсновноеМестоРаботы.Подразделение
	|			И ВТ_ТаблицаДокумента.Должность = ВТ_ОсновноеМестоРаботы.Должность
	|			И ВТ_ТаблицаДокумента.РабочееМесто = ВТ_ОсновноеМестоРаботы.РабочееМесто
	|ГДЕ
	|	ВТ_ОсновноеМестоРаботы.Подразделение ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("Ссылка",			ДокументСсылка);
	Запрос.УстановитьПараметр("ПериодРасчета",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка));
	Запрос.УстановитьПараметр("Организация",	ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Сотрудник",		ДокументСсылка.Сотрудник);
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	//по регистру "Основное место работы сотрудника"
	ТаблицыДляДвижений.Вставить("ТаблицаОсновноеМестоРаботыСотрудника", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть(ТекущийОбъект) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.РабочееМесто,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗанятыеРабочиеМестаОстатки.Подразделение,
	|	ЗанятыеРабочиеМестаОстатки.Должность,
	|	ЗанятыеРабочиеМестаОстатки.РабочееМесто
	|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК ЗанятыеРабочиеМестаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗанятыеРабочиеМеста.Подразделение,
	|	ВТ_ЗанятыеРабочиеМеста.Должность,
	|	ВТ_ЗанятыеРабочиеМеста.РабочееМесто,
	|	ЕСТЬNULL(ВТ_ОсновноеМестоРаботы.ОсновноеМестоРаботы, ЛОЖЬ) КАК ОсновноеМестоРаботы
	|ИЗ
	|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ВТ_ЗанятыеРабочиеМеста.Подразделение = ВТ_ОсновноеМестоРаботы.Подразделение
	|			И ВТ_ЗанятыеРабочиеМеста.Должность = ВТ_ОсновноеМестоРаботы.Должность
	|			И ВТ_ЗанятыеРабочиеМеста.РабочееМесто = ВТ_ОсновноеМестоРаботы.РабочееМесто";
	
	Запрос.УстановитьПараметр("Период",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Сотрудник",	ТекущийОбъект.Сотрудник);
	
	ТекущийОбъект.ОсновноеМестоРаботы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
	
#КонецЕсли
